'''Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
Попросіть користувача ввести свій вік (можно використати константу або input()).
- якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
- якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
- якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"
- якщо вік користувача містить цифру 7 - вивести повідомлення "Вам сьогодні пощастить!"
- у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"
P.S. На екран має бути виведено лише одне повідомлення, якщо вік користувача містить цифру 7 то має бути виведено тільки
відповідне повідомлення! Також подумайте над варіантами, коли введені невірні дані.'''

age = int(input('Скільки Вам років?:'))

if '7' in str(age):
    print("Вам сьогодні пощастить!")
elif age < 1:
    print("Дані не є вірні! Вкажіть ,будь ласка, Ваш справжній вік!")
elif age < 7:
    print("Де твої батьки?")
elif age < 16:
    print("Це фільм для дорослих!")
elif 120 > age > 65:
    print("Покажіть пенсійне посвідчення!")
elif age > 120:
    print("Дані не є вірні! Вкажіть ,будь ласка, Ваш справжній вік!")
else:
    print("А білетів вже немає!")


